sargoliwork101-ui/ESP_APK_COOLLER/firmware/Cooler_ESP32_WROOM_final.ino
#include <WiFi.h>
#include <WebServer.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <time.h>
#include <esp_task_wdt.h>
#include <stdarg.h>
#include "mbedtls/aes.h" // کتابخانه بومی و شتاب‌دهی شده سخت‌افزاری ESP32 برای رمزنگاری متقارن AES
// نکته برای توسعه‌دهنده/هوش مصنوعی آینده:
// webpage.h و کل منطق تولید HTML (تابع قدیمی handleRoot) از فرم‌ور حذف شده‌اند.
// ظاهر و منطق پنل اکنون به‌صورت یک اپ اندروید (WebView/Capacitor) مستقل اجرا می‌شود
// و فقط از طریق همین ۹ مسیر JSON/فرم زیر با برد صحبت می‌کند. هیچ‌کدام از این مسیرها
// یا منطق داخلی‌شان تغییر نکرده‌اند؛ فقط یک مسیر جدید GET /config و هدرهای CORS اضافه شده‌اند.

// ============================================================
//  بخش تنظیمات و ثابت‌ها
//  تمام مقادیر قابل تغییر در اینجا جمع شده‌اند.
//  فقط همین مقادیر را تغییر دهید؛ نیازی به دست زدن به بقیه کد نیست.
// ============================================================

// نام برنامه — در تب مرورگر و نوار بالای پنل نمایش داده می‌شود.
// اگر خواستید نام دستگاه را عوض کنید، فقط این مقدار را تغییر دهید.
const char* PROGRAM_NAME    = "کولر هوشمند ESP32";

// زیرنویس/برند کوچک زیر نام برنامه در نوار بالا (مثلاً مدل برد).
const char* PROGRAM_TAGLINE = "ESP32 · TIMER HUB";

// پایه (پین) خروجی متصل به رله روی برد ESP32-WROOM.
// GPIO23 یک پایه امن برای خروجی است. اگر رله روی پایه دیگری وصل است، فقط این عدد را تغییر دهید.
// نکته: GPIO3 (پایه RX0 سریال) برای رله پیشنهاد نمی‌شود.
const int  RELAY_PIN = 23;

// سطح منطقی که رله را روشن می‌کند:
// رله با فرمان HIGH روشن می‌شود → HIGH  /  با فرمان LOW روشن می‌شود (Active-Low) → LOW
const int  RELAY_ACTIVE_LEVEL = HIGH;

// اختلاف زمان محلی با UTC بر حسب ثانیه. مقدار فعلی UTC+03:30 (ایران) است.
// برای مناطق دیگر فقط این عدد را تغییر دهید (مثلاً UTC+03:30 = 12600).
const long NTP_GMT_OFFSET_SEC = 12600;

// کلید ۱۶ بایتی (۱۲۸ بیتی) برای رمزنگاری و رمزگشایی متقارن رمزهای عبور
// برای تغییر و شخصی‌سازی امنیت سیستم خود، می‌توانید مقادیر این آرایه هگز را به مقادیر تصادفی دیگر تغییر دهید.
const unsigned char AES_KEY[16] = {
  0x4F, 0xA1, 0xC3, 0x92, 0x0E, 0x77, 0xB5, 0x2D,
  0x8C, 0x1A, 0x6F, 0xE4, 0x33, 0xD9, 0x5B, 0x88
};

// نام و رمز شبکه Access Point خود دستگاه (برای اتصال مستقیم گوشی به برد).
// رمز AP طبق قوانین ESP32 باید حداقل ۸ کاراکتر باشد.
char custom_ssid[32]     = "ESP32_Timer_Hub";
char custom_password[32] = "12345678";

// تنظیمات اتصال به مودم/روتر اینترنت (اختیاری).
// اگر خالی بماند، برد فقط Access Point خودش را نگه می‌دارد.
// رمز مودم اختیاری است ولی اگر وارد شود بهتر است حداقل ۸ کاراکتر باشد.
char sta_ssid[32]     = "";
char sta_password[64] = "";

// وضعیت فعال بودن استفاده از اینترنت/NTP روی اتصال STA.
// وقتی false باشد، برد اصلاً به مودم وصل نمی‌شود و از اینترنت/NTP استفاده نمی‌کند.
bool internet_enabled = true;

// چرخه‌ی زمانی اتصال مودم اینترنت (STA).
// اگر مدت خاموش بودن ۰ باشد یعنی اتصال STA همیشه روشن می‌ماند و هیچ چرخه‌ای اعمال نمی‌شود.
int  staOnMinutes  = 10;
int  staOffMinutes = 0;
const int MIN_STA_ON_MINUTES = 1;
const int MIN_STA_OFF_MINUTES = 0;
const int MAX_STA_CYCLE_MINUTES = 1440;
bool staCurrentlyOn = true;
unsigned long staCycleLastToggleMillis = 0;

// ============ چرخه‌ی روشن/خاموش‌سازی دوره‌ای AP (فرستنده وای‌فای خود برد) ============
// هدف: هم پایین آمدن دمای برد (چون رادیوی وای‌فای یکی از منابع اصلی گرمای برد است) و هم کاهش
// تابش دائمی امواج نزدیک انسان. وقتی فعال باشد، AP به‌صورت دوره‌ای روشن و خاموش می‌شود؛
// در بازه‌ی «خاموش»، طبیعتاً گوشی موقتاً به پنل دسترسی ندارد (چون خودِ شبکه قطع است) — این رفتار
// عمدی و بخشی از هدف این قابلیت است. زمان‌بندی سناریوها و رله در تمام این مدت بدون وقفه ادامه دارد
// چون به AP هیچ وابستگی‌ای ندارد.
bool apCycleEnabled = false;          // پیش‌فرض خاموش تا رفتار فعلی کاربرهای قبلی تغییر نکند
int  apOnMinutes  = 10;               // مدت روشن بودن AP در هر دوره (دقیقه)
int  apOffMinutes = 5;                // مدت خاموش بودن AP در هر دوره (دقیقه)
const int MIN_AP_CYCLE_MINUTES = 1;
const int MAX_AP_CYCLE_MINUTES = 1440;
bool apCurrentlyOn = true;            // وضعیت واقعی فعلی AP (برای مدیریت چرخه)
unsigned long apCycleLastToggleMillis = 0;

// سطح قدرت سیگنال‌دهی AP/رادیوی وای‌فای برد (روی کل رادیو اعمال می‌شود، چون ESP32 یک تنظیم توان واحد دارد):
// 0=کم، 1=متوسط، 2=زیاد، 3=حداکثر (مقدار پیش‌فرض سازنده و رفتار قبلی برنامه)
int apTxPowerLevel = 3;
const int MAX_AP_TX_POWER_LEVEL = 3;

// حداکثر تعداد سناریوهای قابل تعریف در پنل.
const int MAX_SCENARIOS = 20;

// حداقل زمان خاموش‌بودن کمپرسور پیش از روشن‌شدن مجدد (دقیقه). صفر = غیرفعال.
int antiShortCycleMinutes = 3;
const int MAX_ANTI_SHORT_CYCLE_MINUTES = 1440;
unsigned long lastRelayOffMillis = 0;

// ظرفیت بافر JSON سناریوها (با حاشیه اطمینان محاسبه شده تا هرگز خطای حافظه ندهد).
const size_t SCENARIOS_JSON_CAPACITY = 6144;
// ============================================================================
// STORAGE / MIGRATION VERSION BANNER — CURRENT REVISION: 6
// دستور مهم برای هر توسعه‌دهنده یا هوش مصنوعی آینده:
// اگر ساختار یا معنای دادهٔ هر فایل ذخیره‌شده را تغییر می‌دهی، شمارهٔ نسخهٔ همان
// فایل را افزایش بده، CURRENT REVISION بالا را هم یک واحد زیاد کن، و مسیر خواندن
// نسخهٔ قبلی (migration) را حفظ کن. هرگز دادهٔ قدیمی کاربر را بی‌هشدار حذف نکن.
// ============================================================================
const int STORAGE_FORMAT_REVISION = 6;
const int SCENARIOS_FILE_VERSION = 2;
const int WIFI_FILE_VERSION = 5; // نسخه 5: حذف کلید جداگانهٔ STA و افزودن زمان‌بندی روشن/خاموش اتصال مودم با staOnMinutes/staOffMinutes
const int TIME_FILE_VERSION = 2;
const int RELAY_STAT_FILE_VERSION = 2;
const int OVERRIDE_FILE_VERSION = 2;
const int PROTECTION_FILE_VERSION = 1;
const int NTP_META_FILE_VERSION = 1;

// زمان‌سنج (Watchdog) اختصاصی ESP32 به ثانیه — در صورت هنگ کردن برد، خودش ری‌استارت می‌شود.
const int WDT_TIMEOUT_SEC = 8;

// فاصله ذخیره پشتیبان دوره‌ای ساعت روی حافظه (برای مقاومت در برابر قطع برق).
// مقدار فعلی هر ۵ دقیقه یک‌بار است.
const unsigned long TIME_SAVE_INTERVAL = 5UL * 60UL * 1000UL;

// فاصله تلاش برای گرفتن ساعت از اینترنت (NTP) تا وقتی که در همین روشن بودن دستگاه هنوز موفق نشده.
// همیشه بلافاصله بعد از هر روشن شدن/ریست برد یک تلاش فوری هم انجام می‌شود (فارغ از این فاصله)،
// و اگر آن تلاش موفق نبود، از همان لحظه هر چند وقت یک‌بار که اینجا مشخص شده دوباره تلاش می‌کند.
// مقدار فعلی هر ۱ دقیقه یک‌بار است. برای تغییر، فقط همین عدد را عوض کنید.
const unsigned long NTP_RETRY_INTERVAL_MS = 1UL * 60UL * 1000UL;

// فاصله بررسی مجدد ساعت از اینترنت بعد از اینکه یک‌بار در همین روشن بودن دستگاه با موفقیت سنکرون شد.
// چون دیگر ساعت درست است، نیازی به چک مکرر نیست؛ این فقط برای اطمینان از عدم انحراف ساعت داخلی برد
// در بلندمدت است. مقدار فعلی هر ۱ ساعت یک‌بار است. برای تغییر، فقط همین عدد را عوض کنید.
const unsigned long NTP_RECHECK_INTERVAL_MS = 1UL * 60UL * 60UL * 1000UL;

