sargoliwork101-ui/ESP_APK_COOLLER/firmware/Cooler_ESP32_WROOM_final.ino
void feedWatchdog() {
  esp_task_wdt_reset();
}
// ============================================================

// تابع کمکی برای escape کردن مقادیر کاربر قبل از قرارگیری داخل attribute های HTML (مثل value='...')
// چون custom_ssid / custom_password / sta_ssid / sta_password از طریق /save-ap و /save-sta توسط خود کاربر
// (حتی با یک درخواست دستی، نه لزوماً فرم مرورگر) قابل تغییرند، بدون این escape یک مقدار حاوی
// کوتیشن یا < > می‌توانست از attribute خارج شده و باعث XSS ذخیره‌شده در پنل تنظیمات شود.
String htmlAttrEscape(const String &raw) {
  String out;
  out.reserve(raw.length() + 8);
  for (size_t i = 0; i < raw.length(); i++) {
    char c = raw[i];
    switch (c) {
      case '&':  out += "&amp;";  break;
      case '\'': out += "&#39;";  break;
      case '"':  out += "&quot;"; break;
      case '<':  out += "&lt;";   break;
      case '>':  out += "&gt;";   break;
      default:   out += c;        break;
    }
  }
  return out;
}

// تابع کمکی برای سوئیچ کردن رله بر اساس منطق (Active-Low یا Active-High)
void setRelay(bool state) {
  if (state) {
    digitalWrite(RELAY_PIN, RELAY_ACTIVE_LEVEL);
  } else {
    digitalWrite(RELAY_PIN, !RELAY_ACTIVE_LEVEL);
  }
}

// ============================================================
//  چرخه‌ی روشن/خاموش دوره‌ای AP + کنترل قدرت سیگنال رادیو وای‌فای
// ============================================================

// اعمال سطح قدرت سیگنال انتخاب‌شده روی رادیوی وای‌فای برد.
// نکته مهم: در ESP32 این تنظیم روی کل رادیو اعمال می‌شود (هم AP هم STA)، چون فقط یک رادیوی
// فیزیکی مشترک وجود دارد؛ تفکیک جداگانه‌ی توان برای AP و STA در سخت‌افزار ESP32 ممکن نیست.
void applyApTxPower() {
  wifi_power_t p;
  switch (apTxPowerLevel) {
    case 0:  p = WIFI_POWER_5dBm;   break; // کم — کمترین مصرف و گرما، برد کوتاه‌تر
    case 1:  p = WIFI_POWER_11dBm;  break; // متوسط
    case 2:  p = WIFI_POWER_15dBm;  break; // زیاد
    default: p = WIFI_POWER_19_5dBm; break; // حداکثر — همان مقدار پیش‌فرض قبلی برنامه
  }
  WiFi.setTxPower(p);
  // برای تشخیص مشکل احتمالی سخت‌افزار/کتابخانه: اگر واقعاً اعمال شده باشد، مقدار خوانده‌شده باید
  // با p یکسان باشد. اگر متفاوت بود یعنی چیزی (مثلاً یک اتصال STA در حال انجام) آن را نادیده گرفته.
  Serial.print("TX Power set to level "); Serial.print(apTxPowerLevel);
  Serial.print(" -> requested="); Serial.print((int)p);
  Serial.print(" actual="); Serial.println((int)WiFi.getTxPower());
}

// روشن/خاموش کردن واقعی رادیوی AP. خاموش کردن با پارامتر true به softAPdisconnect باعث می‌شود
// AP کاملاً از حالت پخش خارج شود (نه فقط قطع کلاینت‌ها)، و دوباره فراخوانی softAP آن را برمی‌گرداند.
// اتصال STA (اینترنت) و تمام منطق رله/سناریو/ساعت کاملاً مستقل از این وضعیت باقی می‌ماند.
void setApRadioState(bool on) {
  if (on == apCurrentlyOn) return;
  if (on) {
    WiFi.softAP(custom_ssid, custom_password, 1, 0, 3);
    applyApTxPower();
  } else {
    WiFi.softAPdisconnect(true);
  }
  apCurrentlyOn = on;
}

// مدیریت چرخه‌ی دوره‌ای AP در loop(). اگر چرخه غیرفعال باشد، فقط مطمئن می‌شویم AP روشن بماند
// (حالت عادی/فعلی برنامه). اگر فعال باشد، بین بازه‌ی روشن و خاموش بر اساس تنظیمات کاربر جابه‌جا می‌شود.
// نکته مهم: تا وقتی حداقل یک گوشی/دستگاه به AP وصل است، تایمر چرخه اصلاً پیش نمی‌رود و AP خاموش
// نمی‌شود؛ فقط بعد از قطع شدن آخرین دستگاه، شمارش مدت «روشن» از نو شروع می‌شود.
void manageApCycle() {
  if (!apCycleEnabled) {
    if (!apCurrentlyOn) {
      setApRadioState(true);
      apCycleLastToggleMillis = millis();
    }
    return;
  }

  // اگر همین الان حداقل یک کلاینت (گوشی/دستگاه) به AP وصل است، چرخه کاملاً متوقف می‌ماند:
  // AP روشن نگه داشته می‌شود و لحظه‌ی شروع شمارش هر بار به «همین الان» به‌روزرسانی می‌شود تا
  // به محض قطع شدن آخرین دستگاه، بازه‌ی «روشن» با شمارش کامل از نو آغاز شود.
  if (apCurrentlyOn && WiFi.softAPgetStationNum() > 0) {
    apCycleLastToggleMillis = millis();
    return;
  }

  unsigned long onMs  = (unsigned long)apOnMinutes  * 60000UL;
  unsigned long offMs = (unsigned long)apOffMinutes * 60000UL;
  unsigned long elapsed = millis() - apCycleLastToggleMillis;

  if (apCurrentlyOn && elapsed >= onMs) {
    setApRadioState(false);
    apCycleLastToggleMillis = millis();
  } else if (!apCurrentlyOn && elapsed >= offMs) {
    setApRadioState(true);
    apCycleLastToggleMillis = millis();
  }
}

// ============================================================
//  توابع رمزنگاری سخت‌افزاری (AES) مختص ESP32
// ============================================================

// این تابع متن ساده رمز را می‌گیرد و به یک رشته رمزگذاری‌شده (تبدیل شده به هگز) برمی‌گرداند.
String encryptPassword(const char* password, size_t bufferSize) {
  if (strlen(password) == 0) return ""; // اگر پسورد خالی بود، چیزی رمزنگاری نمی‌شود

  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, AES_KEY, 128);

  // محاسبه سایز بافر به مضرب ۱۶ (مورد نیاز الگوریتم AES)
  size_t paddedSize = (bufferSize + 15) / 16 * 16;
  unsigned char* input = (unsigned char*)calloc(paddedSize, 1);
  if (!input) return "";
  strncpy((char*)input, password, bufferSize - 1); // کپی رمز بدون سرریز حافظه

  unsigned char* output = (unsigned char*)calloc(paddedSize, 1);
  if (!output) {
    free(input);
    return "";
  }

  // رمزنگاری بلوک به بلوک (هر بلوک ۱۶ بایت)
  for (size_t i = 0; i < paddedSize; i += 16) {
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_ENCRYPT, input + i, output + i);
  }
  mbedtls_aes_free(&aes);

  // تبدیل بایت‌های رمزگذاری‌شده به رشته قابل ذخیره (HEX)
  // پیشوند ENC: مشخص می‌کند که این رشته رمزنگاری شده است
  String hexString = "ENC:";
  for (size_t i = 0; i < paddedSize; i++) {
    char hex[3];
    sprintf(hex, "%02x", output[i]);
    hexString += String(hex);
  }
  
  free(input);
  free(output);
  return hexString;
}

// این تابع مقادیر را از فایل می‌خواند و در صورتی که رمز شده باشد باز می‌کند.
// اگر تنظیمات از قبل (نسخه قدیمی) به صورت متن ساده ذخیره شده باشد، هوشمندانه آن را می‌فهمد.
void loadAndDecryptPassword(const char* savedValue, char* outputBuffer, size_t bufferSize) {
  String val = String(savedValue);
  
  if (val.length() == 0) {
    outputBuffer[0] = '\0';
    return;
  }

  // بررسی اینکه آیا اطلاعات رمزنگاری شده است؟
  if (val.startsWith("ENC:")) {
    String hexString = val.substring(4);
    size_t len = hexString.length();
    
    // اعتبارسنجی طول رشته
    if (len % 32 != 0) return; 

    size_t paddedSize = len / 2;
    unsigned char* input = (unsigned char*)calloc(paddedSize, 1);
    if (!input) return;

    // تبدیل رشته HEX به بایت برای پردازش رمزگشایی
    for (size_t i = 0; i < paddedSize; i++) {
      char hex[3] = {hexString[i * 2], hexString[i * 2 + 1], '\0'};
      input[i] = (unsigned char)strtol(hex, NULL, 16);
    }

    mbedtls_aes_context aes;
    mbedtls_aes_init(&aes);
    mbedtls_aes_setkey_dec(&aes, AES_KEY, 128);

    unsigned char* output = (unsigned char*)calloc(paddedSize, 1);
    if (!output) {
      free(input);
      return;
    }

    // رمزگشایی بلوک به بلوک
    for (size_t i = 0; i < paddedSize; i += 16) {
      mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_DECRYPT, input + i, output + i);
    }
    mbedtls_aes_free(&aes);

    // کپی داده‌های رمزگشایی شده داخل متغیر هدف در برنامه
    size_t copySize = paddedSize < bufferSize ? paddedSize : bufferSize - 1;
    memcpy(outputBuffer, output, copySize);
    outputBuffer[copySize] = '\0';
    
    free(input);
    free(output);
  } else {
    // مقدار ساده است (فایل از قبل با فرمت قدیمی روی برد ذخیره شده بوده)
    strncpy(outputBuffer, savedValue, bufferSize - 1);
    outputBuffer[bufferSize - 1] = '\0';
  }
}

void setup() {
  // راه‌اندازی سریال در ESP32؛ پایه رله از RX0 جدا شده تا تداخل سریال ایجاد نشود
  Serial.begin(115200);
  
  // فعال‌سازی واچ‌داگ مخصوص ESP32 با تایم‌اوت ۸ ثانیه
  setupWatchdog(); 

  // راه‌اندازی حافظه داخلی سیستم 
  // در ESP32 با پارامتر true اگر LittleFS برای اولین بار mount نشود، خودکار فرمت می‌شود
  if (!LittleFS.begin(true)) {
    Serial.println("LittleFS Mount Failed even after formatting!");
  }

  // لود کردن تنظیمات ذخیره شده
  loadScenarios();
  loadWiFiSettings(); // در این بخش رمزها خودکار رمزگشایی می‌شوند
  loadOverrideSetting(); // لود کردن وضعیت دستی
  loadProtectionSettings(); // لود کردن محافظت ضد روشن/خاموش شدن سریع
  loadTimeSetting();     
  loadRelayStats();      // لود کردن آمار سوییچ/مدت‌کارکرد رله ذخیره شده
  loadNtpSuccessInfo();  // لود کردن آخرین دریافت موفق ساعت از اینترنت

