sargoliwork101-ui/ESP_APK_COOLLER/firmware/Cooler_ESP32_WROOM_final.ino
  // تنظیم پین رله
  pinMode(RELAY_PIN, OUTPUT);

  // *** اعمال فوری وضعیت کلید دستی بلافاصله پس از راه‌اندازی ***
  // در صورتی که قبل از قطعی برق رله روی حالت دستی روشن بوده، دوباره بی‌قید و شرط روشن می‌ماند
  if (manual_override == 1) {
    setRelay(true);
  } else {
    setRelay(false);
  }

  // *** هماهنگ کردن آمار رله با وضعیت واقعی سخت‌افزار بلافاصله بعد از بوت ***
  // مهم: اگر رله از قبل (قبل از این ریست/قطعی برق) روشن بوده و همچنان روشن می‌ماند، این ادامه‌ی همان
  // دوره‌ی کارکرد کمپرسور است، نه یک سوییچ جدید؛ پس این را در lastRelayStatState بدون افزایش شمارنده
  // ثبت می‌کنیم تا اولین بررسی در checkScenarios() آن را به اشتباه یک «سوییچ جدید» حساب نکند.
  lastRelayStatState = (manual_override == 1) ? 1 : 0;
  // بعد از بوت، اگر رله خاموش است یک دوره‌ی محافظه‌کارانه شروع می‌شود؛ چون وضعیت واقعی
  // کمپرسور درست پیش از قطع برق قابل اعتماد نیست.
  if (lastRelayStatState == 0) lastRelayOffMillis = millis();
  if (lastRelayStatState == 1) {
    relayOnSinceMillis = millis();
    relayCurrentlyOnForStats = true;
  }

  // راه‌اندازی وای‌فای به صورت همزمان: AP برای اتصال مستقیم گوشی + STA برای اتصال اختیاری به اینترنت
  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(false);              // جلوگیری از نوشتن بی‌مورد تنظیمات وای‌فای روی فلش داخلی ESP32
  WiFi.setAutoReconnect(true);         // در فاز روشنِ STA اگر اتصال به مودم قطع شد، خود برد دوباره تلاش کند
  WiFi.softAP(custom_ssid, custom_password, 1, 0, 3);
  applyApTxPower();      // اعمال سطح قدرت سیگنال ذخیره‌شده (یا پیش‌فرض حداکثر)
  apCurrentlyOn = true;
  apCycleLastToggleMillis = millis();
  Serial.println("Access Point Started");

  // آغاز فاز اولیهٔ اتصال STA. اگر اینترنت فعال و تنظیمات مودم موجود باشد، اتصال برقرار می‌شود؛
  // در غیر این صورت STA خاموش می‌ماند تا بعداً از پنل فعال شود.
  staCurrentlyOn = true;
  staCycleLastToggleMillis = millis();
  connectToInternetWiFi();

  // تعریف کنترل‌کننده‌های وب‌سرور
  // مسیر "/" دیگر HTML نمی‌فرستد؛ ظاهر برنامه اکنون داخل اپ اندروید است.
  // به‌جایش یک مسیر سبک GET /config اضافه شده که تنها یک‌بار در شروع اپ خوانده می‌شود
  // و همان مقادیری را برمی‌گرداند که قبلاً داخل خودِ HTML جاسازی می‌شدند (سناریوها، SSID/رمزها و...).
  server.on("/config", HTTP_GET, handleGetConfig);
  server.on("/save", HTTP_POST, handleSaveScenario);
  server.on("/sync", HTTP_POST, handleSyncTime);
  server.on("/status", HTTP_GET, handleGetStatus);
  server.on("/toggle-manual", HTTP_POST, handleToggleManual);
  server.on("/save-ap", HTTP_POST, handleSaveAP);
  server.on("/save-sta", HTTP_POST, handleSaveSTA);
  server.on("/save-protection", HTTP_POST, handleSaveProtection);
  server.on("/save-ap-cycle", HTTP_POST, handleSaveApCycle);

  // چون حالا درخواست‌ها از یک اپ/WebView با «مبدأ» متفاوت (نه از خود برد) ارسال می‌شوند،
  // مرورگر برای برخی درخواست‌ها (مثلاً بدنه JSON در /save) ابتدا یک درخواست OPTIONS
  // (preflight) می‌فرستد. برای همه‌ی مسیرها یک پاسخ خالی با هدر CORS ثبت می‌کنیم.
  server.on("/config", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/save", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/sync", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/status", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/toggle-manual", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/save-ap", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/save-sta", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/save-protection", HTTP_OPTIONS, handleCorsPreflight);
  server.on("/save-ap-cycle", HTTP_OPTIONS, handleCorsPreflight);

  server.begin();
  lastTick = millis();
  lastTimeSaveMillis = millis();
}

void loop() {
  feedWatchdog(); // تغذیه واچ‌داگ مخصوص ESP32
  
  // واچ‌داگ نرم‌افزاری برای بررسی سلامت رم (برای جلوگیری از هنگ کردن کامل تحت تداخل نویز)
  // یک افت لحظه‌ای و گذرای حافظه (مثلاً وسط پردازش یک درخواست وب) طبیعی است؛
  // فقط وقتی چند بار پیاپی زیر آستانه بمانیم، یعنی واقعاً نشتی/کمبود داریم و باید ری‌استارت کنیم.
  static int lowHeapStreak = 0;
  if (ESP.getFreeHeap() < 2000) {
    lowHeapStreak++;
    if (lowHeapStreak >= 5) {
      Serial.println("Memory too low! Restarting safely to prevent freeze.");
      saveTimeSetting();
      ESP.restart();
    }
  } else {
    lowHeapStreak = 0;
  }

  // مدیریت ریستارت نرم‌افزاری امن 
  if (pendingReset && (millis() - resetMillis > 2000)) {
    saveTimeSetting(); 
    ESP.restart();
  }

  server.handleClient();
  updateClock();
  manageStaCycle();  // مدیریت دوره‌ای قطع/وصل اتصال مودم اینترنت (STA)
  tryNtpSync();      // گرفتن ساعت از اینترنت در صورت وصل بودن به مودم، بدون نیاز به گوشی
  checkScenarios();
  manageApCycle();   // مدیریت چرخه‌ی دوره‌ای روشن/خاموش AP (برای کاهش دما و تابش دائمی)

  // ذخیره پشتیبان دوره‌ای زمان (هر ۵ دقیقه یک‌بار) تا در صورت قطعی برق ناگهانی،
  // حداکثر چند دقیقه از ساعت عقب بمانیم. این کار جدا از ذخیره فوری قبل از هر فرمان قطع/وصل رله است.
  if (time_synchronized && (millis() - lastTimeSaveMillis >= TIME_SAVE_INTERVAL)) {
    saveTimeSetting();
  }

  // ذخیره پیشرفت دوره‌ی جاری «روشن بودن» رله (هر همان فاصله TIME_SAVE_INTERVAL) تا اگر کمپرسور مدت
  // طولانی روشن بماند و درست وسط آن برق قطع شود، حداکثر همین چند دقیقه از مدت‌کارکرد از دست برود.
  // نقطه‌ی شروع دوره جلو کشیده می‌شود تا هنگام محاسبه بعدی، مدت قبلاً ذخیره‌شده دوباره شمارش نشود.
  if (relayCurrentlyOnForStats && (millis() - lastRelayStatSaveMillis >= TIME_SAVE_INTERVAL)) {
    unsigned long elapsedSec = (millis() - relayOnSinceMillis) / 1000UL;
    relayTotalOnSeconds += elapsedSec;
    relayOnSinceMillis += elapsedSec * 1000UL;
    saveRelayStats();
  }

  // --- محافظت اضافه در برابر بازنشانی خاموش/بی‌صدای قدرت سیگنال توسط استک وای‌فای ---
  // دقیقاً مشابه تکنیک بازنشانی pinMode رله در ادامه: هر ۳۰ ثانیه یک‌بار سطح قدرت سیگنال انتخابی
  // کاربر دوباره روی رادیو اعمال می‌شود، چون برخی رویدادهای داخلی وای‌فای (اتصال/قطع STA، اسکن و...)
  // می‌توانند بی‌سروصدا این مقدار را به پیش‌فرض (حداکثر) برگردانند.
  static unsigned long lastTxPowerRefresh = 0;
  if (millis() - lastTxPowerRefresh >= 30000UL) {
    applyApTxPower();
    lastTxPowerRefresh = millis();
  }

