sargoliwork101-ui/ESP_APK_COOLLER/firmware/Cooler_ESP32_WROOM_final.ino
  // --- محافظت اضافه در برابر نویز رله (EMI) ---
  // هر ۳۰ ثانیه یک‌بار، جهت پین رله (OUTPUT) دوباره تنظیم می‌شود. نویز شدید ناشی از قطع/وصل
  // رله مجاور در موارد نادر می‌تواند حتی رجیستر پیکربندی جهت پین (نه فقط مقدار خروجی) را دستکاری کند؛
  // این کار هزینه‌ی تقریباً صفر دارد و تضمین می‌کند پین همیشه به‌عنوان خروجی باقی بماند.
  static unsigned long lastPinModeRefresh = 0;
  if (millis() - lastPinModeRefresh >= 30000UL) {
    pinMode(RELAY_PIN, OUTPUT);
    lastPinModeRefresh = millis();
  }
  
  // جایگزین delay(10) برای جلوگیری از مسدود شدن هسته و تنفس بهتر پردازنده و وای‌فای
  yield(); 
}

void updateClock() {
  // از while به‌جای if استفاده شده: اگر loop() به هر دلیلی (نوشتن روی فلش، تاخیر وای‌فای و ...)
  // بیش از ۱ ثانیه بلاک شود، ساعت باید همان لحظه جبران شود، نه اینکه طی چند اجرای بعدی loop()
  // به‌تدریج جمع شود.
  while (millis() - lastTick >= 1000) {
    lastTick += 1000;
    currentSecond++;
    if (currentSecond >= 60) {
      currentSecond = 0;
      currentMinute++;
      if (currentMinute >= 60) {
        currentMinute = 0;
        currentHour++;
        if (currentHour >= 24) {
          currentHour = 0;
          advanceDate();
        }
      }
    }
  }
}

bool isLeapYear(int year) { return (year % 4 == 0 && year % 100 != 0) || (year % 400 == 0); }

void advanceDate() {
  const int daysInMonth[] = {31,28,31,30,31,30,31,31,30,31,30,31};
  int maxDay = daysInMonth[currentMonth - 1];
  if (currentMonth == 2 && isLeapYear(currentYear)) maxDay = 29;
  currentDay++;
  if (currentDay > maxDay) { currentDay = 1; currentMonth++; if (currentMonth > 12) { currentMonth = 1; currentYear++; } }
  currentWeekday = (currentWeekday + 1) % 7;
}

void checkScenarios() {
  // جلوگیری از ذخیره‌سازی/لاگ بی‌دلیل با کش کردن وضعیت منطقی قبلی
  static int lastKnownState = -1; 
  bool desiredState;

  // اگر کنترل دستی روشن است، هیچ سناریویی بررسی نمی‌شود
  if (manual_override == 1) {
    desiredState = true;
    if (lastKnownState != 1) {
      if (time_synchronized) saveTimeSetting(); // ذخیره زمان قبل از فرمان قطع/وصل رله
      lastKnownState = 1;
    }
  }
  // اگر پس از قطع برق هنوز ساعت همگام‌سازی نشده باشد، رله خاموش می‌ماند
  else if (!time_synchronized) {
    desiredState = false;
    if (lastKnownState != 0) {
      lastKnownState = 0;
    }
  }
  else {
    desiredState = false;
    int currentMinutesSinceMidnight = currentHour * 60 + currentMinute;

    for (int i = 0; i < MAX_SCENARIOS; i++) {
      // سناریوی حذف‌شده یا غیرفعال فقط نمایش داده/ذخیره می‌شود و اجرا نمی‌شود
      if (!scenarios[i].active || !scenarios[i].enabled) continue;

      int startMinutes = scenarios[i].startHour * 60 + scenarios[i].startMinute;
      int endMinutes = scenarios[i].endHour * 60 + scenarios[i].endMinute;
      uint8_t selectedDays = scenarios[i].weekdays;

      if (startMinutes == endMinutes || selectedDays == 0) continue;
      // در سناریوی عبور از نیمه‌شب، بخش بعد از نیمه‌شب متعلق به روز شروع سناریو است.
      int scenarioDay = currentWeekday;
      if (startMinutes > endMinutes && currentMinutesSinceMidnight < endMinutes) scenarioDay = (currentWeekday + 6) % 7;
      if ((selectedDays & (1 << scenarioDay)) == 0) continue;

      if (startMinutes < endMinutes) {
        if (currentMinutesSinceMidnight >= startMinutes && currentMinutesSinceMidnight < endMinutes) {
          desiredState = true;
          break;
        }
      } else {
        if (currentMinutesSinceMidnight >= startMinutes || currentMinutesSinceMidnight < endMinutes) {
          desiredState = true;
          break;
        }
      }
    }

    int newKnownState = desiredState ? 1 : 0;
    if (lastKnownState != newKnownState) {
      saveTimeSetting(); // ذخیره زمان قبل از فرمان قطع/وصل رله
      lastKnownState = newKnownState;
    }
  }

  // --- محافظت در برابر نویز رله مجاور (EMI) ---
  // پین رله در هر اجرای loop() دوباره نوشته می‌شود، نه فقط زمانی که وضعیت منطقی عوض شده باشد.
  // دلیل: اگر نویز الکتریکی حاصل از قطع/وصل رله کناری باعث برگشتن اتفاقی رجیستر خروجی GPIO شود،
  // قبلاً چون فقط با تغییر lastKnownState دوباره digitalWrite زده می‌شد، فریمور متوجه این "پرش" پین
  // نمی‌شد و رله تا تغییر منطقی بعدی در وضعیت غلط می‌ماند. دیگیتال‌رایت هزینه‌ی محاسباتی ناچیزی دارد،
  // پس نوشتن مکرر آن هیچ ضرری ندارد ولی از ماندگاری اثر نویز روی پین جلوگیری می‌کند.
  // توجه: ذخیره‌سازی فلش (saveTimeSetting) و لاگ فقط روی تغییر واقعی state انجام می‌شود، نه هر بار.

  // --- Anti Short-Cycle Protection ---
  // هر فرمان روشن‌شدن، از جمله حالت دستی، تا سپری‌شدن حداقل زمان خاموشی نگه داشته می‌شود.
  if (desiredState && antiShortCycleMinutes > 0 && lastRelayStatState == 0) {
    unsigned long requiredMs = (unsigned long)antiShortCycleMinutes * 60UL * 1000UL;
    if (millis() - lastRelayOffMillis < requiredMs) desiredState = false;
  }

  // --- آمار سوییچ و مدت‌کارکرد رله (برای پایش سلامت/عمر کمپرسور) ---
  // این بخش کاملاً جدا از lastKnownState بالا کار می‌کند تا به منطق اصلی سناریو/دستی دست زده نشود؛
  // فقط تغییر واقعی وضعیت خروجی رله را (فارغ از دلیل: سناریو یا دستی) برای آمار ثبت می‌کند.
  int newRelayStatState = desiredState ? 1 : 0;
  if (lastRelayStatState != newRelayStatState) {
    if (newRelayStatState == 1) {
      // کمپرسور تازه روشن شد: یک سوییچ جدید و شروع اندازه‌گیری این دوره
      relaySwitchCount++;
      relayOnSinceMillis = millis();
      relayCurrentlyOnForStats = true;
    } else {
      // کمپرسور تازه خاموش شد: مدت این دوره به مجموع اضافه می‌شود
      if (relayCurrentlyOnForStats) {
        relayTotalOnSeconds += (millis() - relayOnSinceMillis) / 1000UL;
      }
      relayCurrentlyOnForStats = false;
      lastRelayOffMillis = millis();
    }
    lastRelayStatState = newRelayStatState;
    saveRelayStats(); // ذخیره فوری هر رویداد واقعی سوییچ، مشابه ذخیره فوری ساعت قبل از فرمان رله
  }

  setRelay(desiredState);
}

void loadScenarios() {
  if (!LittleFS.exists("/scenarios.json")) return;
  
  File configFile = LittleFS.open("/scenarios.json", "r");
  if (!configFile) return;

  // تغییر به DynamicJsonDocument برای جلوگیری از Stack Overflow
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  DeserializationError error = deserializeJson(doc, configFile);
  configFile.close();

  if (error) {
    Serial.print("loadScenarios JSON error: ");
    Serial.println(error.c_str());
    return;
  }

  // Migration سناریوها: نسخه ۱ آرایهٔ مستقیم بود؛ نسخه ۲ یک شیء شامل version و items است.
  JsonArray array = doc.is<JsonArray>() ? doc.as<JsonArray>() : doc["items"].as<JsonArray>();
  int i = 0;
  for (JsonObject v : array) {
    if (i >= MAX_SCENARIOS) break;
    bool itemActive = v["active"] | false;
    scenarios[i].active = itemActive;
    // برای سازگاری با فایل‌های قدیمی: اگر کلید en وجود نداشت، سناریوهای موجود فعال فرض می‌شوند
    scenarios[i].enabled = v.containsKey("en") ? (bool)v["en"] : itemActive;
    scenarios[i].startHour = v["sh"] | 0;
    scenarios[i].startMinute = v["sm"] | 0;
    scenarios[i].endHour = v["eh"] | 0;
    scenarios[i].endMinute = v["em"] | 0;
    // سازگاری با سناریوهای قدیمی: نبودن wd یعنی اجرا در تمام روزها
    scenarios[i].weekdays = v.containsKey("wd") ? (uint8_t)(v["wd"] | 0x7F) : 0x7F;
    i++;
  }
}

