sargoliwork101-ui/ESP_APK_COOLLER/firmware/Cooler_ESP32_WROOM_final.ino
// تلاش دوره‌ای و غیرمسدودکننده برای دریافت ساعت از اینترنت
void tryNtpSync() {
  // نکته مهم: اینجا از ntp_synced_this_boot استفاده می‌شود، نه time_synchronized.
  // time_synchronized ممکن است از فایل ذخیره‌شده (سنکرون قبلی با گوشی یا بوت قبلی) از همان لحظه بوت true باشد؛
  // اگر آن را ملاک فاصله‌ی تلاش قرار می‌دادیم، برد فکر می‌کرد NTP قبلاً موفق بوده و به‌جای هر ۱ دقیقه
  // هر ۱ ساعت یک‌بار تلاش می‌کرد — یعنی با اینکه به مودم وصل است، ممکن بود تا یک ساعت ساعت واقعی نگیرد.
  unsigned long interval = ntp_synced_this_boot ? NTP_RECHECK_INTERVAL_MS : NTP_RETRY_INTERVAL_MS;

  if (!internet_enabled) return;
  if (!staCurrentlyOn) return;
  if (strlen(sta_ssid) == 0) return;

  if (ntpFirstCheckPending) {
    // اولین بار بعد از این بوت یا بعد از تغییر تنظیمات مودم: فارغ از فاصله‌ی زمانی، همین الان تلاش کن
    ntpFirstCheckPending = false;
  } else if (millis() - lastNtpCheckMillis < interval) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    // تا وقتی واقعاً به مودم وصل نشده‌ایم، زمان آخرین تلاش را جلو نمی‌بریم تا
    // به محض برقراری اتصال، گرفتن ساعت بدون انتظار اضافه انجام شود.
    return;
  }

  lastNtpCheckMillis = millis();

  time_t now = time(nullptr);
  struct tm *tmInfo = localtime(&now);

  // اگر سال معتبر بود یعنی NTP زمان واقعی داده است.
  if (tmInfo && (tmInfo->tm_year + 1900) >= 2024) {
    currentHour = tmInfo->tm_hour;
    currentMinute = tmInfo->tm_min;
    currentSecond = tmInfo->tm_sec;
    currentYear = tmInfo->tm_year + 1900;
    currentMonth = tmInfo->tm_mon + 1;
    currentDay = tmInfo->tm_mday;
    currentWeekday = (tmInfo->tm_wday + 1) % 7;
    lastTick = millis();

    if (!ntp_synced_this_boot) {
      Serial.println("Time synchronized by internet NTP.");
    }

    time_synchronized = true;
    ntp_synced_this_boot = true;
    ntpEverSucceeded = true;
    ntpLastSuccessYear = currentYear;
    ntpLastSuccessMonth = currentMonth;
    ntpLastSuccessDay = currentDay;
    ntpLastSuccessHour = currentHour;
    ntpLastSuccessMinute = currentMinute;
    ntpLastSuccessSecond = currentSecond;
    ntpLastSuccessValid = true;
    saveTimeSetting();     // ساعت اینترنتی معتبر را ذخیره کن تا در قطعی برق کوتاه از دست نرود
    saveNtpSuccessInfo();  // فقط آخرین دریافت موفق NTP ذخیره می‌شود، نه تلاش‌های ناموفق
  }
}

// اجازه‌ی دسترسی از مبدأ اپ اندروید/WebView به این وب‌سرور (CORS).
// چون اینجا هیچ کوکی/اطلاعات ورودی حساسی رد و بدل نمی‌شود، "*" (همه مبداها) مشکلی ندارد.
void addCorsHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

// پاسخ به درخواست‌های OPTIONS (preflight) که مرورگر/WebView پیش از برخی درخواست‌های
// cross-origin (مثلاً بدنه JSON) خودکار می‌فرستد.
void handleCorsPreflight() {
  addCorsHeaders();
  server.send(204);
}

// جایگزین سبک تابع قدیمی handleRoot: فقط داده‌های اولیه‌ای که قبلاً داخل خودِ HTML
// جاسازی می‌شدند (سناریوها، SSID/رمز AP و STA و...) را یک‌بار به‌صورت JSON برمی‌گرداند.
// اپ اندروید این مسیر را فقط یک‌بار موقع باز شدن صفحه صدا می‌زند؛ وضعیت زنده همچنان از /status می‌آید.
// منطق و مقداردهی هیچ‌کدام از فیلدها نسبت به نسخه‌ی قبلی HTML تغییری نکرده است.
void handleGetConfig() {
  addCorsHeaders();
  DynamicJsonDocument doc(4096);
  doc["programName"] = PROGRAM_NAME;
  doc["programTagline"] = PROGRAM_TAGLINE;
  doc["manualOverride"] = manual_override;
  doc["apSsid"] = custom_ssid;
  doc["apPass"] = custom_password;
  doc["staSsid"] = sta_ssid;
  doc["staPass"] = sta_password;
  doc["internetEnabled"] = internet_enabled ? 1 : 0;
  doc["staOnMinutes"] = staOnMinutes;
  doc["staOffMinutes"] = staOffMinutes;
  doc["apCycleEnabled"] = apCycleEnabled ? 1 : 0;
  doc["apOnMinutes"] = apOnMinutes;
  doc["apOffMinutes"] = apOffMinutes;
  doc["apTxPowerLevel"] = apTxPowerLevel;
  doc["antiShortCycleMinutes"] = antiShortCycleMinutes;

  JsonArray arr = doc.createNestedArray("scenarios");
  for (int i = 0; i < MAX_SCENARIOS; i++) {
    JsonObject o = arr.createNestedObject();
    o["active"] = scenarios[i].active ? 1 : 0;
    o["enabled"] = scenarios[i].enabled ? 1 : 0;
    o["sh"] = scenarios[i].startHour;
    o["sm"] = scenarios[i].startMinute;
    o["eh"] = scenarios[i].endHour;
    o["em"] = scenarios[i].endMinute;
    o["wd"] = scenarios[i].weekdays;
  }

  String out;
  serializeJson(doc, out);
  server.send(200, "application/json", out);
}

void handleSaveScenario() {
  addCorsHeaders();
  if (!allowRequest(lastSaveScenarioRequest, 1200UL)) return;
  if (!server.hasArg("plain")) {
    server.send(400, "text/plain", "Bad Request");
    return;
  }

  String body = server.arg("plain");
  // تغییر به DynamicJsonDocument برای جلوگیری از Stack Overflow
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  DeserializationError error = deserializeJson(doc, body);

  if (error) {
    server.send(400, "text/plain", "Invalid JSON");
    return;
  }

  if (!doc.is<JsonArray>()) {
    server.send(400, "text/plain", "Invalid JSON");
    return;
  }

  JsonArray array = doc.as<JsonArray>();
  Scenario temp[MAX_SCENARIOS]; 

  int i = 0;
  for (JsonObject v : array) {
    if (i >= MAX_SCENARIOS) break;
    temp[i].active = true;
    temp[i].enabled = v["en"] | true; // این کلید اجرای سناریو را بدون حذف کردن کنترل می‌کند
    temp[i].startHour = v["sh"] | 0;
    temp[i].startMinute = v["sm"] | 0;
    temp[i].endHour = v["eh"] | 0;
    temp[i].endMinute = v["em"] | 0;
    temp[i].weekdays = v.containsKey("wd") ? (uint8_t)(v["wd"] | 0x7F) : 0x7F;
    i++;
  }

  bool isChanged = false;
  for (int j = 0; j < MAX_SCENARIOS; j++) {
    if (scenarios[j].active != temp[j].active ||
        scenarios[j].enabled != temp[j].enabled ||
        scenarios[j].startHour != temp[j].startHour ||
        scenarios[j].startMinute != temp[j].startMinute ||
        scenarios[j].endHour != temp[j].endHour ||
        scenarios[j].endMinute != temp[j].endMinute ||
        scenarios[j].weekdays != temp[j].weekdays) {
      isChanged = true;
      break;
    }
  }

  if (isChanged) {
    for (int j = 0; j < MAX_SCENARIOS; j++) {
      scenarios[j] = temp[j];
    }
    saveScenarios();
  }
  
  server.send(200, "text/plain", "Updated");
}

