sargoliwork101-ui/ESP_APK_COOLLER/firmware/Cooler_ESP32_WROOM_final.ino
void handleSyncTime() {
  addCorsHeaders();
  if (!allowRequest(lastSyncRequest, 1000UL)) return;
  if (server.hasArg("h") && server.hasArg("m") && server.hasArg("s") && server.hasArg("y") && server.hasArg("mon") && server.hasArg("d") && server.hasArg("wd")) {
    int h = server.arg("h").toInt();
    int m = server.arg("m").toInt();
    int s = server.arg("s").toInt();
    int y = server.arg("y").toInt(), mon = server.arg("mon").toInt(), d = server.arg("d").toInt(), wd = server.arg("wd").toInt();

    // اعتبارسنجی بازه‌ی مقادیر؛ بدون این چک یک درخواست دستکاری‌شده می‌توانست
    // ساعت داخلی برد را با عددی نامعتبر (مثلاً 99) خراب کند و منطق سناریوها را به‌هم بریزد.
    if (h < 0 || h > 23 || m < 0 || m > 59 || s < 0 || s > 59 || y < 2024 || mon < 1 || mon > 12 || d < 1 || d > 31 || wd < 0 || wd > 6) {
      server.send(400, "text/plain", "Invalid Time Range");
      return;
    }

    currentHour = h;
    currentMinute = m;
    currentSecond = s;
    currentYear = y; currentMonth = mon; currentDay = d; currentWeekday = wd;
    lastTick = millis();
    time_synchronized = true;
    saveTimeSetting(); 
    server.send(200, "text/plain", "OK");
  } else {
    server.send(400, "text/plain", "Bad Request");
  }
}

void handleGetStatus() {
  addCorsHeaders();
  // پنل هر ۱ ثانیه درخواست می‌دهد؛ حد ۲۵۰ms فقط اسپم غیرعادی را رد می‌کند.
  if (!allowRequest(lastStatusRequest, 150UL)) return;
  char timeStr[9];
  sprintf(timeStr, "%02d:%02d:%02d", currentHour, currentMinute, currentSecond);

  // خواندن وضعیت منطقی به جای وضعیت خام پین
  int logicalState = (digitalRead(RELAY_PIN) == RELAY_ACTIVE_LEVEL) ? 1 : 0;

  int staConnected = (WiFi.status() == WL_CONNECTED) ? 1 : 0;
  int staConfigured = (strlen(sta_ssid) > 0) ? 1 : 0;
  char staIp[16] = "";
  if (staConnected) {
    IPAddress ip = WiFi.localIP();
    snprintf(staIp, sizeof(staIp), "%u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
  }

  // --- وضعیت STA برای نمایش در پنل ---
  // 0 = غیرفعال/تنظیم‌نشده
  // 1 = در حال تلاش برای اتصال، هنوز هیچ‌وقت موفق نشده (نارنجی)
  // 2 = متصل (سبز)
  // 3 = قبلاً وصل بوده و الان قطع است (قرمز)
  // 4 = طبق زمان‌بندی، موقتاً در فاز خاموش چرخه قرار دارد
  int staState;
  if (!internet_enabled || !staConfigured) {
    staState = 0;
  } else if (staOffMinutes > 0 && !staCurrentlyOn) {
    staState = 4;
  } else if (staConnected) {
    staEverConnectedThisBoot = true;
    staState = 2;
  } else if (staEverConnectedThisBoot) {
    staState = 3;
  } else {
    staState = 1;
  }

  // مجموع مدت‌کارکرد رله برای نمایش زنده: مقدار قطعی‌شده + مدت دوره‌ی جاری (اگر همین الان روشن است)
  unsigned long liveOnSeconds = relayTotalOnSeconds;
  if (relayCurrentlyOnForStats) {
    liveOnSeconds += (millis() - relayOnSinceMillis) / 1000UL;
  }

  long protectionRemainingSec = 0;
  if (antiShortCycleMinutes > 0 && lastRelayStatState == 0) {
    unsigned long requiredMs = (unsigned long)antiShortCycleMinutes * 60UL * 1000UL;
    unsigned long elapsed = millis() - lastRelayOffMillis;
    if (elapsed < requiredMs) protectionRemainingSec = (long)((requiredMs - elapsed + 999UL) / 1000UL);
  }

  // وضعیت چرخه‌ی AP: تا چند ثانیه دیگر تا تغییر فاز بعدی (روشن<->خاموش) باقی مانده.
  int apStationCount = apCurrentlyOn ? WiFi.softAPgetStationNum() : 0;
  long apRemainingSec = 0;
  if (apCycleEnabled) {
    unsigned long phaseMs = apCurrentlyOn ? ((unsigned long)apOnMinutes * 60000UL) : ((unsigned long)apOffMinutes * 60000UL);
    unsigned long elapsed = millis() - apCycleLastToggleMillis;
    if (elapsed < phaseMs) apRemainingSec = (long)((phaseMs - elapsed + 999UL) / 1000UL);
  }

  // وضعیت چرخه‌ی STA: فقط وقتی اینترنت فعال و مودم تنظیم شده باشد معنا دارد.
  long staRemainingSec = 0;
  if (internet_enabled && staConfigured && staOffMinutes > 0) {
    unsigned long phaseMs = staCurrentlyOn ? ((unsigned long)staOnMinutes * 60000UL) : ((unsigned long)staOffMinutes * 60000UL);
    unsigned long elapsed = millis() - staCycleLastToggleMillis;
    if (elapsed < phaseMs) staRemainingSec = (long)((phaseMs - elapsed + 999UL) / 1000UL);
  }

  char json[1152];
  snprintf(json, sizeof(json), "{\"time\":\"%s\",\"relay\":%d,\"override\":%d,\"sync\":%d,\"sta\":%d,\"internetEnabled\":%d,\"staConfigured\":%d,\"staState\":%d,\"staIp\":\"%s\",\"staOnMinutes\":%d,\"staOffMinutes\":%d,\"staPhaseOn\":%d,\"staRemaining\":%ld,\"ntpOk\":%d,\"ntpLastValid\":%d,\"ntpYear\":%d,\"ntpMonth\":%d,\"ntpDay\":%d,\"ntpHour\":%d,\"ntpMinute\":%d,\"ntpSecond\":%d,\"switchCount\":%lu,\"onSeconds\":%lu,\"weekday\":%d,\"year\":%d,\"month\":%d,\"day\":%d,\"protectionMinutes\":%d,\"protectionRemaining\":%ld,\"apCycleEnabled\":%d,\"apOn\":%d,\"apOnMinutes\":%d,\"apOffMinutes\":%d,\"apTxPowerLevel\":%d,\"apRemaining\":%ld,\"apClientConnected\":%d}",
    timeStr, logicalState, manual_override, time_synchronized ? 1 : 0, staConnected, internet_enabled ? 1 : 0, staConfigured, staState, staIp,
    staOnMinutes, staOffMinutes, staCurrentlyOn ? 1 : 0, staRemainingSec,
    ntpEverSucceeded ? 1 : 0, ntpLastSuccessValid ? 1 : 0, ntpLastSuccessYear, ntpLastSuccessMonth, ntpLastSuccessDay, ntpLastSuccessHour, ntpLastSuccessMinute, ntpLastSuccessSecond, relaySwitchCount, liveOnSeconds, currentWeekday, currentYear, currentMonth, currentDay, antiShortCycleMinutes, protectionRemainingSec,
    apCycleEnabled ? 1 : 0, apCurrentlyOn ? 1 : 0, apOnMinutes, apOffMinutes, apTxPowerLevel, apRemainingSec, (apStationCount > 0) ? 1 : 0);
  server.send(200, "application/json", json);
}

void handleToggleManual() {
  addCorsHeaders();
  // مهم‌ترین محدودیت: رله بیشتر از یک‌بار در ۱.۵ ثانیه فرمان دستی نمی‌گیرد.
  if (!allowRequest(lastToggleManualRequest, 1500UL)) return;
  // === راه حل اساسی جلوگیری از کرش موقع استارت موتور ===
  // ابتدا فایل فلش نوشته می‌شود، سپس رله تغییر وضعیت می‌دهد!
  if (manual_override == 0) {
    manual_override = 1; 
    saveOverrideSetting(); // اول روی حافظه نوشته شود
    if (time_synchronized) saveTimeSetting(); // ذخیره زمان قبل از فرمان قطع/وصل رله
    delay(100);            // تاخیر 100 میلی ثانیه جهت اتمام کامل عملیات نوشتن و پایداری ولتاژ
    checkScenarios();      // روشن‌شدن دستی هم باید از همان محافظ ضد استارت مکرر عبور کند
  } else {
    manual_override = 0; 
    saveOverrideSetting(); 
    if (time_synchronized) saveTimeSetting(); // ذخیره زمان قبل از فرمان قطع/وصل رله
    delay(100);
    checkScenarios();      // رله خاموش یا به حالت زمانبندی برگردد
  }
  
  server.send(200, "text/plain", "OK");
}

// ذخیره تنظیمات فرستنده (Access Point) — شبکه‌ای که گوشی مستقیم به آن وصل می‌شود.
// چون نام/رمز همین شبکه عوض می‌شود، گوشی باید دوباره به شبکه جدید وصل شود؛
// برای اطمینان از اعمال کامل تنظیمات AP، برد ری‌استارت می‌شود.
void handleSaveAP() {
  addCorsHeaders();
  if (!allowRequest(lastSaveApRequest, 3000UL)) return;
  if (server.hasArg("ssid") && server.hasArg("pass")) {
    String new_ssid = server.arg("ssid");
    String new_pass = server.arg("pass");

    // رمز AP خود برد طبق قانون ESP32 باید حداقل ۸ کاراکتر باشد.
    if (new_ssid.length() > 0 && new_pass.length() >= 8) {
      new_ssid.toCharArray(custom_ssid, 32);
      new_pass.toCharArray(custom_password, 32);
      saveWiFiSettings();
      saveTimeSetting();

      server.send(200, "text/plain", "OK");

      pendingReset = true;
      resetMillis = millis();
      return;
    }
  }
  server.send(400, "text/plain", "Bad Request");
}

// ذخیره تنظیمات اتصال به مودم/روتر اینترنت (STA) + کلید فعال‌سازی اینترنت.
// این بخش شبکهٔ AP خود برد را تغییر نمی‌دهد، پس نیازی به ری‌استارت برد نیست؛
// چرخهٔ STA همان لحظه با تنظیمات جدید از نو شروع می‌شود و AP/ارتباط گوشی دست‌نخورده می‌ماند.
void handleSaveSTA() {
  addCorsHeaders();
  if (!allowRequest(lastSaveStaRequest, 1500UL)) return;
  String new_sta_ssid = server.hasArg("sta_ssid") ? server.arg("sta_ssid") : "";
  String new_sta_pass = server.hasArg("sta_pass") ? server.arg("sta_pass") : "";
  String new_internet = server.hasArg("internet") ? server.arg("internet") : "";
  String new_sta_on = server.hasArg("sta_on_minutes") ? server.arg("sta_on_minutes") : "";
  String new_sta_off = server.hasArg("sta_off_minutes") ? server.arg("sta_off_minutes") : "";

