sargoliwork101-ui/ESP_APK_COOLLER/firmware/Cooler_ESP32_WROOM_final.ino
  // رمز مودم اینترنت اختیاری است؛ اگر وارد شود بهتر است حداقل ۸ کاراکتر باشد.
  if (new_sta_pass.length() > 0 && new_sta_pass.length() < 8) {
    server.send(400, "text/plain", "Bad Request");
    return;
  }

  if (new_sta_on.length() == 0 || new_sta_off.length() == 0) {
    server.send(400, "text/plain", "Bad Request");
    return;
  }
  for (size_t i = 0; i < new_sta_on.length(); i++) if (!isDigit(new_sta_on[i])) { server.send(400, "text/plain", "Bad Request"); return; }
  for (size_t i = 0; i < new_sta_off.length(); i++) if (!isDigit(new_sta_off[i])) { server.send(400, "text/plain", "Bad Request"); return; }

  int onVal = new_sta_on.toInt();
  int offVal = new_sta_off.toInt();
  if (onVal < MIN_STA_ON_MINUTES || onVal > MAX_STA_CYCLE_MINUTES) { server.send(400, "text/plain", "Bad Request"); return; }
  if (offVal < MIN_STA_OFF_MINUTES || offVal > MAX_STA_CYCLE_MINUTES) { server.send(400, "text/plain", "Bad Request"); return; }

  internet_enabled = (new_internet == "1");
  staOnMinutes = onVal;
  staOffMinutes = offVal;
  new_sta_ssid.toCharArray(sta_ssid, 32);
  new_sta_pass.toCharArray(sta_password, 64);
  saveWiFiSettings();

  // اجازه بده تلاش بعدی NTP بلافاصله (هر ۱ دقیقه) انجام شود، نه اینکه منتظر فاصله‌ی قبلی بماند.
  ntp_synced_this_boot = false;
  ntpFirstCheckPending = true;
  lastNtpCheckMillis = 0;
  staEverConnectedThisBoot = false;

  // چرخهٔ STA با تنظیمات جدید از نو شروع می‌شود و ابتدا وارد فاز روشن می‌شود؛
  // اگر اینترنت خاموش باشد یا SSID خالی باشد، connectToInternetWiFi خودش STA را خاموش نگه می‌دارد.
  WiFi.setAutoReconnect(false);
  WiFi.disconnect(false);
  staCurrentlyOn = true;
  staCycleLastToggleMillis = millis();
  connectToInternetWiFi();

  server.send(200, "text/plain", "OK");
}

// ذخیرهٔ زمان محافظت؛ بدون ری‌استارت و با اعتبارسنجی کامل.
void handleSaveProtection() {
  addCorsHeaders();
  if (!allowRequest(lastSaveProtectionRequest, 1000UL)) return;
  if (!server.hasArg("min_off")) { server.send(400, "text/plain", "Bad Request"); return; }
  String raw = server.arg("min_off");
  if (raw.length() == 0) { server.send(400, "text/plain", "Bad Request"); return; }
  for (size_t i = 0; i < raw.length(); i++) if (!isDigit(raw[i])) { server.send(400, "text/plain", "Bad Request"); return; }
  int value = raw.toInt();
  if (value < 0 || value > MAX_ANTI_SHORT_CYCLE_MINUTES) { server.send(400, "text/plain", "Bad Request"); return; }
  antiShortCycleMinutes = value;
  saveProtectionSettings();
  server.send(200, "text/plain", "OK");
}

// ذخیرهٔ تنظیمات چرخه‌ی روشن/خاموش AP و قدرت سیگنال. بدون ری‌استارت اعمال می‌شود.
// نکته: بلافاصله بعد از ذخیره، تایمر چرخه از نو شروع می‌شود و مطمئن می‌شویم AP روشن است تا
// همین درخواستِ ذخیره (که از طریق خودِ AP ارسال شده) به‌محض ثبت قطع نشود.
void handleSaveApCycle() {
  addCorsHeaders();
  if (!allowRequest(lastSaveApCycleRequest, 1000UL)) return;

  if (!server.hasArg("on_minutes") || !server.hasArg("off_minutes") || !server.hasArg("tx_power")) {
    server.send(400, "text/plain", "Bad Request");
    return;
  }

  String onRaw = server.arg("on_minutes");
  String offRaw = server.arg("off_minutes");
  String powerRaw = server.arg("tx_power");
  String enabledRaw = server.hasArg("cycle_enabled") ? server.arg("cycle_enabled") : "";

  if (onRaw.length() == 0 || offRaw.length() == 0 || powerRaw.length() == 0) {
    server.send(400, "text/plain", "Bad Request"); return;
  }
  for (size_t i = 0; i < onRaw.length(); i++) if (!isDigit(onRaw[i])) { server.send(400, "text/plain", "Bad Request"); return; }
  for (size_t i = 0; i < offRaw.length(); i++) if (!isDigit(offRaw[i])) { server.send(400, "text/plain", "Bad Request"); return; }
  for (size_t i = 0; i < powerRaw.length(); i++) if (!isDigit(powerRaw[i])) { server.send(400, "text/plain", "Bad Request"); return; }

  int onVal = onRaw.toInt();
  int offVal = offRaw.toInt();
  int powerVal = powerRaw.toInt();

  if (onVal < MIN_AP_CYCLE_MINUTES || onVal > MAX_AP_CYCLE_MINUTES) { server.send(400, "text/plain", "Bad Request"); return; }
  if (offVal < MIN_AP_CYCLE_MINUTES || offVal > MAX_AP_CYCLE_MINUTES) { server.send(400, "text/plain", "Bad Request"); return; }
  if (powerVal < 0 || powerVal > MAX_AP_TX_POWER_LEVEL) { server.send(400, "text/plain", "Bad Request"); return; }

  apCycleEnabled = (enabledRaw == "1");
  apOnMinutes = onVal;
  apOffMinutes = offVal;
  apTxPowerLevel = powerVal;
  applyApTxPower();

  // شروع دوباره‌ی تایمر چرخه و اطمینان از روشن بودن AP همین الان (تا درخواست جاری قطع نشود)
  apCycleLastToggleMillis = millis();
  if (!apCurrentlyOn) setApRadioState(true);

  saveWiFiSettings();
  server.send(200, "text/plain", "OK");
}
